
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * module.pcq-db-flexible.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.pcq-db-flexible.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.pcq-db-flexible.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.pcq-db-flexible.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
* Replace
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.pcq-db-flexible.azurerm_monitor_action_group.db-alerts-action-group[0] will be created
  + resource "azurerm_monitor_action_group" "db-alerts-action-group" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "db_monitor_ag-pcq-backend-flexible-prod"
      + resource_group_name = "pcq-backend-flexible-data-prod"
      + short_name          = "db_monitor_a"
      + tags                = {
          + "application"         = "protected-characteristics-questionnaire"
          + "builtFrom"           = "https://github.com/HMCTS/pcq-backend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#pcq-dev"
          + "environment"         = "production"
          + "managedBy"           = "PCQ"
        }

      + email_receiver {
          + email_address           = (sensitive value)
          + name                    = "Email Receiver"
          + use_common_alert_schema = true
        }
    }

  # module.pcq-db-flexible.azurerm_monitor_metric_alert.db_alert_cpu[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
      + auto_mitigate            = true
      + description              = "Whenever the cpu utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_cpu_percent_pcq-backend-flexible-prod"
      + resource_group_name      = "pcq-backend-flexible-data-prod"
      + scopes                   = [
          + "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-backend-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/pcq-backend-flexible-prod",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "protected-characteristics-questionnaire"
          + "builtFrom"           = "https://github.com/HMCTS/pcq-backend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#pcq-dev"
          + "environment"         = "production"
          + "managedBy"           = "PCQ"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.pcq-db-flexible.azurerm_monitor_metric_alert.db_alert_memory[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_memory" {
      + auto_mitigate            = true
      + description              = "Whenever the memory utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_memory_percent_pcq-backend-flexible-prod"
      + resource_group_name      = "pcq-backend-flexible-data-prod"
      + scopes                   = [
          + "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-backend-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/pcq-backend-flexible-prod",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "protected-characteristics-questionnaire"
          + "builtFrom"           = "https://github.com/HMCTS/pcq-backend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#pcq-dev"
          + "environment"         = "production"
          + "managedBy"           = "PCQ"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.pcq-db-flexible.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
      + auto_mitigate            = true
      + description              = "Whenever the storage utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_storage_utilization_pcq-backend-flexible-prod"
      + resource_group_name      = "pcq-backend-flexible-data-prod"
      + scopes                   = [
          + "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-backend-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/pcq-backend-flexible-prod",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "protected-characteristics-questionnaire"
          + "builtFrom"           = "https://github.com/HMCTS/pcq-backend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#pcq-dev"
          + "environment"         = "production"
          + "managedBy"           = "PCQ"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.sdp_db_user[0].data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-prod"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-prod-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user[0].data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/pcq-backend-flexible-prod-read-user-name/9fe5e9d6b1fa4f20b815306d36470d89" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" -> (known after apply) # forces replacement
        name                    = "pcq-backend-flexible-prod-read-user-name"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/pcq-backend-flexible-prod-read-user-name/versions/9fe5e9d6b1fa4f20b815306d36470d89" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/pcq-backend-flexible-prod-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "9fe5e9d6b1fa4f20b815306d36470d89" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/pcq-backend-flexible-prod-read-user-name" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/pcq-backend-flexible-prod-read-user-password/00de719311a547f18ab9d18b91b7ce8e" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" -> (known after apply) # forces replacement
        name                    = "pcq-backend-flexible-prod-read-user-password"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/pcq-backend-flexible-prod-read-user-password/versions/00de719311a547f18ab9d18b91b7ce8e" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/pcq-backend-flexible-prod-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "00de719311a547f18ab9d18b91b7ce8e" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/pcq-backend-flexible-prod-read-user-password" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1367,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->